---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelPhysicalType
source: html/5cbb637f-85f3-a74c-4613-2fab0d3668e3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelPhysicalType Property

"Family Type": the Family Type of the physical element associated with the Analytical Model

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelPhysicalType { get; }
```